# Generic Zone Geometric Definition Property

Source: https://www.revitapidocs.com/2026/fba6de2b-90e7-88e0-c97f-dbf36fc74d38.htm

---

| Generic Zone Geometric Definition Property |
| --- |

The geometric definition for this generic zone.
**Namespace:** Autodesk.Revit.DB.Analysis
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ZoneGeometricDefinition GeometricDefinition { get; }
```

```
Public ReadOnly Property GeometricDefinition As ZoneGeometricDefinition
	Get
```

```
public:
property ZoneGeometricDefinition GeometricDefinition {
	ZoneGeometricDefinition get ();
}
```

```
member GeometricDefinition : ZoneGeometricDefinition with get
```

#### Property Value

ZoneGeometricDefinition See Also

#### Reference

GenericZone Class Autodesk.Revit.DB.Analysis Namespace